In [1]:
import pandas as pd

In [3]:
import pandas as pd
data = {
    'Department': ['HR', 'HR', 'IT', 'IT', 'Finance', 'Finance', 'Mood'],
    'Name': ['Nikunj', 'Rohan', 'Defaulter', 'Jayant', 'Kartik', 'Frank', 'George'],
    'Salary': [50000, 55000, 60000, 65000, 70000, 72000, 58000],
    'Experience': [6, 3, 2, 4, 5, 7, 2]
}

df = pd.DataFrame(data)

##  1. Group by Department

In [7]:
grouped = df.groupby('Department')
print(grouped['Salary'].mean())

Department
Finance    71000.0
HR         52500.0
IT         62500.0
Mood       58000.0
Name: Salary, dtype: float64

##  2. Multiple Aggregations using .agg()

In [9]:
df.groupby('Department')['Salary'].agg(['mean', 'max', 'min'])

               mean    max    min
Department
Finance     71000.0  72000  70000
HR          52500.0  55000  50000
IT          62500.0  65000  60000
Mood        58000.0  58000  58000

## 3. Group by Multiple Columns

In [10]:
df.groupby(['Department','Experience'])['Salary'].mean()

Department  Experience
Finance     5             70000.0
            7             72000.0
HR          3             55000.0
            6             50000.0
IT          2             60000.0
            4             65000.0
Mood        2             58000.0
Name: Salary, dtype: float64

## 4. Count Unique & Total Entries`

In [12]:
df['Department'].value_counts()
df.groupby('Department')['Name'].nunique()

Department
Finance    2
HR         2
IT         2
Mood       1
Name: Name, dtype: int64

##  5. Custom Aggregations

In [13]:
def range_fn(x):
    return x.max() - x.min()

df.groupby('Department')['Salary'].agg(['mean', range_fn])

               mean  range_fn
Department
Finance     71000.0      2000
HR          52500.0      5000
IT          62500.0      5000
Mood        58000.0         0

##  6. Resetting Grouped Data

In [14]:
df.groupby('Department')['Salary'].mean().reset_index()

  Department   Salary
0    Finance  71000.0
1         HR  52500.0
2         IT  62500.0
3       Mood  58000.0